nxp-mcuxpresso/mcux-devices-mcx/MCXA/MCXA577/iar/startup_MCXA577.s
; -------------------------------------------------------------------------
;  @file:    startup_MCXA577.s
;  @purpose: CMSIS Cortex-M33 Core Device Startup File
;            MCXA577
;  @version: 2.0
;  @date:    2024-10-29
;  @build:   b251124
; -------------------------------------------------------------------------
;
; Copyright 1997-2016 Freescale Semiconductor, Inc.
; Copyright 2016-2025 NXP
; SPDX-License-Identifier: BSD-3-Clause
;
; The modules in this file are included in the libraries, and may be replaced
; by any user-defined modules that define the PUBLIC symbol _program_start or
; a user defined start symbol.
; To override the cstartup defined in the library, simply add your modified
; version to the workbench project.
;
; The vector table is normally located at address 0.
; When debugging in RAM, it can be located in RAM, aligned to at least 2^6.
; The name "__vector_table" has special meaning for C-SPY:
; it is where the SP start value is found, and the NVIC vector
; table register (VTOR) is initialized to this address if != 0.
;
; Cortex-M version
;

        MODULE  ?cstartup

        ;; Forward declaration of sections.
        SECTION CSTACK:DATA:NOROOT(3)

        SECTION .intvec:CODE:NOROOT(2)

        EXTERN  __iar_program_start
        EXTERN  SystemInit
        PUBLIC  __vector_table
        PUBLIC  __vector_table_0x1c
        PUBLIC  __Vectors
        PUBLIC  __Vectors_End
        PUBLIC  __Vectors_Size

        DATA

__iar_init$$done:              ; The vector table is not needed
                      ; until after copy initialization is done

__vector_table
        DCD     sfe(CSTACK)
        DCD     Reset_Handler

        DCD     NMI_Handler                                   ;NMI Handler
        DCD     HardFault_Handler                             ;Hard Fault Handler
        DCD     MemManage_Handler                             ;MPU Fault Handler
        DCD     BusFault_Handler                              ;Bus Fault Handler
        DCD     UsageFault_Handler                            ;Usage Fault Handler
__vector_table_0x1c
        DCD     SecureFault_Handler                           ;Secure Fault Handler
        DCD     0                                             ;Reserved
        DCD     0                                             ;Reserved
        DCD     0                                             ;Reserved
        DCD     SVC_Handler                                   ;SVCall Handler
        DCD     DebugMon_Handler                              ;Debug Monitor Handler
        DCD     0                                             ;Reserved
        DCD     PendSV_Handler                                ;PendSV Handler
        DCD     SysTick_Handler                               ;SysTick Handler

                                                              ;External Interrupts
        DCD     Reserved16_IRQHandler                         ;OR IRQ1 to IRQ53
        DCD     CMC_IRQHandler                                ;Core Mode Controller interrupt
        DCD     DMA0_CH0_IRQHandler                           ;DMA3_0_CH0 error or transfer complete
        DCD     DMA0_CH1_IRQHandler                           ;DMA3_0_CH1 error or transfer complete
        DCD     DMA0_CH2_IRQHandler                           ;DMA3_0_CH2 error or transfer complete
        DCD     DMA0_CH3_IRQHandler                           ;DMA3_0_CH3 error or transfer complete
        DCD     DMA0_CH4_IRQHandler                           ;DMA3_0_CH4 error or transfer complete
        DCD     DMA0_CH5_IRQHandler                           ;DMA3_0_CH5 error or transfer complete
        DCD     DMA0_CH6_IRQHandler                           ;DMA3_0_CH6 error or transfer complete
        DCD     DMA0_CH7_IRQHandler                           ;DMA3_0_CH7 error or transfer complete
        DCD     ERM0_SINGLE_BIT_IRQHandler                    ;ERM Single Bit error interrupt
        DCD     ERM0_MULTI_BIT_IRQHandler                     ;ERM Multi Bit error interrupt
        DCD     FMU0_IRQHandler                               ;Flash Management Unit interrupt
        DCD     GLIKEY0_IRQHandler                            ;GLIKEY Interrupt
        DCD     MBC0_IRQHandler                               ;MBC secure violation interrupt
        DCD     SCG0_IRQHandler                               ;System Clock Generator interrupt
        DCD     SPC0_IRQHandler                               ;System Power Controller interrupt
        DCD     TDET_IRQHandler                               ;TDET interrrupt
        DCD     WUU0_IRQHandler                               ;Wake Up Unit interrupt
        DCD     CAN0_IRQHandler                               ;Controller Area Network 0 interrupt
        DCD     CAN1_IRQHandler                               ;Controller Area Network 1 interrupt
        DCD     Reserved37_IRQHandler                         ;xxx Interrupt 37
        DCD     Reserved38_IRQHandler                         ;xxx Interrupt 38
        DCD     FLEXIO_IRQHandler                             ;Flexible Input/Output interrupt
        DCD     I3C0_IRQHandler                               ;Improved Inter Integrated Circuit interrupt 0
        DCD     I3C1_IRQHandler                               ;Improved Inter Integrated Circuit interrupt 1
        DCD     LPI2C0_IRQHandler                             ;Low-Power Inter Integrated Circuit 0 interrupt
        DCD     LPI2C1_IRQHandler                             ;Low-Power Inter Integrated Circuit 1 interrupt
        DCD     LPSPI0_IRQHandler                             ;Low-Power Serial Peripheral Interface 0 interrupt
        DCD     LPSPI1_IRQHandler                             ;Low-Power Serial Peripheral Interface 1 interrupt
        DCD     LPSPI2_IRQHandler                             ;Low-Power Serial Peripheral Interface 2 interrupt
        DCD     LPUART0_IRQHandler                            ;Low-Power Universal Asynchronous Receive/Transmit 0 interrupt
        DCD     LPUART1_IRQHandler                            ;Low-Power Universal Asynchronous Receive/Transmit 1 interrupt
        DCD     LPUART2_IRQHandler                            ;Low-Power Universal Asynchronous Receive/Transmit 2 interrupt
        DCD     LPUART3_IRQHandler                            ;Low-Power Universal Asynchronous Receive/Transmit 3 interrupt
        DCD     LPUART4_IRQHandler                            ;Low-Power Universal Asynchronous Receive/Transmit 4 interrupt
        DCD     Reserved52_IRQHandler                         ;xxx Interrupt 52
        DCD     Reserved53_IRQHandler                         ;xxx Interrupt 53
        DCD     CDOG0_IRQHandler                              ;Code Watchdog Timer 0 interrupt
        DCD     CTIMER0_IRQHandler                            ;Standard counter/timer 0 interrupt
        DCD     CTIMER1_IRQHandler                            ;Standard counter/timer 1 interrupt
        DCD     CTIMER2_IRQHandler                            ;Standard counter/timer 2 interrupt
        DCD     CTIMER3_IRQHandler                            ;Standard counter/timer 3 interrupt
        DCD     CTIMER4_IRQHandler                            ;Standard counter/timer 4 interrupt
        DCD     Reserved60_IRQHandler                         ;xxx Interrupt 60
        DCD     Reserved61_IRQHandler                         ;xxx Interrupt 61
        DCD     Reserved62_IRQHandler                         ;xxx Interrupt 62
        DCD     Reserved63_IRQHandler                         ;xxx Interrupt 63
        DCD     Reserved64_IRQHandler                         ;xxx Interrupt 64
        DCD     Reserved65_IRQHandler                         ;xxx Interrupt 65
        DCD     Reserved66_IRQHandler                         ;xxx Interrupt 66
        DCD     Reserved67_IRQHandler                         ;xxx Interrupt 67
        DCD     Reserved68_IRQHandler                         ;xxx Interrupt 68
        DCD     Reserved69_IRQHandler                         ;xxx Interrupt 69
        DCD     FREQME0_IRQHandler                            ;Frequency Measurement interrupt
        DCD     LPTMR0_IRQHandler                             ;Low Power Timer 0 interrupt
        DCD     Reserved72_IRQHandler                         ;xxx Interrupt 72
        DCD     OS_EVENT_IRQHandler                           ;OS event timer interrupt
        DCD     WAKETIMER0_IRQHandler                         ;Wake Timer Interrupt
        DCD     UTICK0_IRQHandler                             ;Micro-Tick Timer interrupt
        DCD     WWDT0_IRQHandler                              ;Windowed Watchdog Timer 0 interrupt
        DCD     WWDT1_IRQHandler                              ;Windowed Watchdog Timer 2 interrupt
        DCD     ADC0_IRQHandler                               ;Analog-to-Digital Converter 0 interrupt
        DCD     ADC1_IRQHandler                               ;Analog-to-Digital Converter 1 interrupt
        DCD     CMP0_IRQHandler                               ;Comparator 0 interrupt
        DCD     Reserved81_IRQHandler                         ;xxx Interrupt 81
        DCD     Reserved82_IRQHandler                         ;xxx Interrupt 82
        DCD     DAC0_IRQHandler                               ;Digital-to-Analog Converter 0 - General Purpose interrupt
        DCD     DAC1_IRQHandler                               ;Digital-to-Analog Converter 1 - General Purpose interrupt
        DCD     Reserved85_IRQHandler                         ;xxx Interrupt 85
        DCD     Reserved86_IRQHandler                         ;xxx Interrupt 86
        DCD     GPIO0_IRQHandler                              ;General Purpose Input/Output 0 interrupt 0
        DCD     GPIO1_IRQHandler                              ;General Purpose Input/Output 1 interrupt 0
        DCD     GPIO2_IRQHandler                              ;General Purpose Input/Output 2 interrupt 0
        DCD     GPIO3_IRQHandler                              ;General Purpose Input/Output 3 interrupt 0
        DCD     GPIO4_IRQHandler                              ;General Purpose Input/Output 4 interrupt 0
        DCD     GPIO5_IRQHandler                              ;General Purpose Input/Output 5 interrupt 0
        DCD     LPI2C2_IRQHandler                             ;Low-Power Inter Integrated Circuit 2 interrupt
        DCD     LPI2C3_IRQHandler                             ;Low-Power Inter Integrated Circuit 3 interrupt
        DCD     Reserved95_IRQHandler                         ;xxx Interrupt 95
        DCD     Reserved96_IRQHandler                         ;xxx Interrupt 96
        DCD     Reserved97_IRQHandler                         ;xxx Interrupt 97
        DCD     Reserved98_IRQHandler                         ;xxx Interrupt 98
        DCD     Reserved99_IRQHandler                         ;xxx Interrupt 99
        DCD     Reserved100_IRQHandler                        ;xxx Interrupt 100
        DCD     Reserved101_IRQHandler                        ;xxx Interrupt 101
        DCD     Reserved102_IRQHandler                        ;xxx Interrupt 102
        DCD     Reserved103_IRQHandler                        ;xxx Interrupt 103
        DCD     Reserved104_IRQHandler                        ;xxx Interrupt 104
        DCD     ESPI_IRQHandler                               ;eSPI interrupt
        DCD     ETHERNET_IRQHandler                           ;Ethernet QoS interrupt
        DCD     ETHERNET_PMT_IRQHandler                       ;Ethernet QoS power management interrupt
        DCD     Reserved108_IRQHandler                        ;xxx Interrupt 108
        DCD     TENBASET_PHY0_IRQHandler                      ;10Base-T1S interrupt
        DCD     I3C2_IRQHandler                               ;Improved Inter Integrated Circuit interrupt 2
        DCD     LPUART5_IRQHandler                            ;Low-Power Universal Asynchronous Receive/Transmit interrupt
        DCD     Reserved112_IRQHandler                        ;xxx Interrupt 112
        DCD     LPSPI3_IRQHandler                             ;Low-Power Serial Peripheral Interface 3 interrupt
        DCD     LPSPI4_IRQHandler                             ;Low-Power Serial Peripheral Interface 4 interrupt
        DCD     LPSPI5_IRQHandler                             ;Low-Power Serial Peripheral Interface 5 interrupt
        DCD     LPI2C4_IRQHandler                             ;Low-Power Inter Integrated Circuit 4 interrupt
        DCD     I3C3_IRQHandler                               ;Improved Inter Integrated Circuit interrupt 3
        DCD     Reserved118_IRQHandler                        ;xxx Interrupt 118
        DCD     USB1_HS_IRQHandler                            ;USB High Speed OTG Controller interrupt
        DCD     USB1_HS_PHY_IRQHandler                        ;USBHS DCD or USBHS Phy interrupt
        DCD     Reserved121_IRQHandler                        ;xxx Interrupt 121
        DCD     FLEXSPI0_IRQHandler                           ;Flexible Serial Peripheral Interface interrupt
        DCD     Reserved123_IRQHandler                        ;xxx Interrupt 123
        DCD     SMARTDMA_IRQHandler                           ;SmartDMA interrupt
        DCD     CDOG1_IRQHandler                              ;Code Watchdog Timer 1 interrupt
        DCD     PKC_IRQHandler                                ;PKC interrupt
        DCD     SGI_IRQHandler                                ;SGI interrupt
        DCD     SPI_FILTER_IRQHandler                         ;Reserved interrupt
        DCD     TRNG0_IRQHandler                              ;True Random Number Generator interrupt
        DCD     SECURE_ERR_IRQHandler                         ;Secure IP Error interrupt. It OR SGI, PKC, TRNG error together.
        DCD     SEC_HYPERVISOR_CALL_IRQHandler                ;AHB Secure Controller hypervisor call interrupt
        DCD     Reserved132_IRQHandler                        ;xxx Interrupt 132
        DCD     Reserved133_IRQHandler                        ;xxx Interrupt 133
        DCD     Reserved134_IRQHandler                        ;xxx Interrupt 134
        DCD     RTC_IRQHandler                                ;RTC alarm interrupt
        DCD     Reserved136_IRQHandler                        ;xxx Interrupt 136
        DCD     Reserved137_IRQHandler                        ;xxx Interrupt 137
        DCD     GDET_IRQHandler                               ;Digital Glitch Detect 0 interrupt
        DCD     EWM0_IRQHandler                               ;External Watchdog Monitor interrupt
        DCD     TSI_END_OF_SCAN_IRQHandler                    ;TSI End of Scan interrupt
        DCD     TSI_OUT_OF_SCAN_IRQHandler                    ;TSI Out of Scan interrupt
        DCD     GPIO0_1_IRQHandler                            ;General Purpose Input/Output 0 interrupt 1
        DCD     GPIO1_1_IRQHandler                            ;General Purpose Input/Output 1 interrupt 1
        DCD     GPIO2_1_IRQHandler                            ;General Purpose Input/Output 2 interrupt 1
        DCD     GPIO3_1_IRQHandler                            ;General Purpose Input/Output 3 interrupt 1
        DCD     GPIO4_1_IRQHandler                            ;General Purpose Input/Output 4 interrupt 1
        DCD     GPIO5_1_IRQHandler                            ;General Purpose Input/Output 5 interrupt 1
        DCD     Reserved148_IRQHandler                        ;xxx Interrupt 148
        DCD     ITRC0_IRQHandler                              ;Intrusion and Tamper Response Controller interrupt
        DCD     DMA0_CH8_IRQHandler                           ;DMA3_0_CH8 error or transfer complete
        DCD     DMA0_CH9_IRQHandler                           ;DMA3_0_CH9 error or transfer complete
        DCD     DMA0_CH10_IRQHandler                          ;DMA3_0_CH10 error or transfer complete
        DCD     DMA0_CH11_IRQHandler                          ;DMA3_0_CH11 error or transfer complete
        DCD     Reserved154_IRQHandler                        ;xxx Interrupt 154
        DCD     Reserved155_IRQHandler                        ;xxx Interrupt 155
        DCD     Reserved156_IRQHandler                        ;xxx Interrupt 156
        DCD     Reserved157_IRQHandler                        ;xxx Interrupt 157
        DCD     DMA1_CH0_IRQHandler                           ;DMA3_1_CH0 error or transfer complete
        DCD     DMA1_CH1_IRQHandler                           ;DMA3_1_CH1 error or transfer complete
        DCD     DMA1_CH2_IRQHandler                           ;DMA3_1_CH2 error or transfer complete
        DCD     DMA1_CH3_IRQHandler                           ;DMA3_1_CH3 error or transfer complete
__Vectors_End

__Vectors       EQU   __vector_table
__Vectors_Size  EQU   __Vectors_End - __Vectors


;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;
;; Default interrupt handlers.
;;
        THUMB

        PUBWEAK Reset_Handler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reset_Handler
        CPSID   I               ; Mask interrupts
        LDR     R0, =0xE000ED08
        LDR     R1, =__vector_table
        STR     R1, [R0]
        LDR     R2, [R1]
        MSR     MSP, R2
        LDR     R0, =sfb(CSTACK)
        MSR     MSPLIM, R0
        CPSIE   I               ; Unmask interrupts
        LDR     R0, =SystemInit
        BLX     R0
        LDR     R0, =__iar_program_start
        BX      R0

        PUBWEAK NMI_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
NMI_Handler
        B .

        PUBWEAK HardFault_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
HardFault_Handler
        B .

        PUBWEAK MemManage_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
MemManage_Handler
        B .

        PUBWEAK BusFault_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
BusFault_Handler
        B .

